from gmssl import sm3, func

if __name__ == '__main__':
    #下面是真正的消息，"bcde"是要进行hash的数据，把这个的输出放到attack里的 hashcode 里，就可以进行拓展攻击，在末尾加个"x80x00..x00a"
    #y = sm3.sm3_hash(func.bytes_to_list(b"bcde"))

    #下面是验证拓展攻击("bcde"+...+"a")是否成功的，若这个的hash值和拓展攻击的输出一样，则攻击成功
    m=[98, 99, 100, 101, 128, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32,97]
    y=sm3.sm3_hash(m)
    print(y)
